Revit 2027 API
AnalysisDisplayMarkersAndTextSettings.IsEqual Method
 Compares two colored surface settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayMarkersAndTextSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayMarkersAndTextSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayMarkersAndTextSettings^ other
)
member IsEqual :
        other : AnalysisDisplayMarkersAndTextSettings -> bool
Parameters
other AnalysisDisplayMarkersAndTextSettings
 Markers and text settings object to compare with.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace